// –екламный еженедельник выходит в свет по четвергам. ќпределить номер последнего вышедшего печатного издани€, если известна сегодн€шн€€ дата.


#include "stdafx.h"
#include <stdlib.h>
#include <locale.h>
#include <conio.h>

int main()
{
	system("color F0");
	setlocale(LC_ALL, "rus");
	int d1, m1, y1, d2, m2, y2, n1, n2, buffDay, dday, k, n, kdm[] = {31,28,31,30,31,30,31,31,30,31,30,31} ;

	do																		//¬вод даты начала отсчЄта
	  {
		printf("¬ведите дату начала отсчЄта (четверг)\n");
		scanf("%d %d %d", &d1, &m1, &y1);

		if(m1 == 2)
			if(m1 == 2 && y1%4 == 0 && y1%100 != 0 || y1%400 == 0)
				buffDay = 29;
			else
				buffDay = 28;
		else
			buffDay = kdm[m1 - 1];

		if(m1 < 3)
			{
				n1 = (26 * (m1 + 13)) / 10;
				n2 = (int) ((125 * (y1 - 1)) / 100);				
				dday = ((d1 + n1 + n2 - ((y1 - 1) / 100) + ((y1 - 1) / 400) -1) % 7);		//ƒень недели начала отсчЄта
			}
		else
			{
				n1 = (26 * (m1 + 1)) / 10; 
				n2 = (int) ((125 * y1) / 100);
				dday = ((d1 + n1 + n2 - (y1 / 100) + (y1 / 400) -1) % 7);			//ƒень недели начала отсчЄта 
			}
	  }
	while(m1 > 12 || m1 <= 0  || y1 >= 10000 || y1 <= 0 || d1 <=0 || d1 > buffDay || dday != 4);
		printf("%d.%d.%d \n", d1, m1, y1);									//¬ывод на экран даты начала отсчЄта

	do																		//¬вод сегодн€шней даты
	  {
		printf("¬ведите сегодн€шнюю дату\n");
		scanf("%d %d %d", &d2, &m2, &y2);
		if(m2 == 2)
			if(m2 == 2 && y2%4 == 0 && y2%100 != 0 || y2%400 == 0)
				buffDay = 29;
			else
				buffDay = 28;
		else
			buffDay = kdm[m2 - 1];

	  }
	while(m2 > 12 || m2 <= 0  || y2 >= 10000 || y2 <= 0 || d2 <=0 || d2 > buffDay);
		printf("%d.%d.%d \n", d2, m2, y2);									//¬ывод на экран даты сегодн€шнего дн€

		if(y1%4 == 0 && y1%100 != 0 || y1%400 == 0)							//ќпределение количества дней в феврале
			kdm[1] = 29;
		else
			kdm[1] = 28;

		if(y1 == y2 && m1 == m2)											//ќпределение количества дней между датами
			k = d2 - d1;
		else if(y1 == y2 && m1 != m2)
			{
				k = kdm[m1 - 1] - d1 + d2;
				for(int i = m1; i <= m2 - 2; i++)
					k = k + kdm[i];
			}
			else
				{
					k = kdm[m1 - 1] - d1 + d2;
					if(y1%4 == 0 && y1%100 != 0 || y1%400 == 0)
						kdm[1] = 29;
					else
						kdm[1] = 28;
					for(int i = m1; i <= 11; i++)
						k = k + kdm[i];

					for(int i = 0; i <= m2 - 2; i++)
						k = k + kdm[i];

					for(int i = y1 + 1; i <= y2 - 1; i++)
						if(i%4 == 0 && i%100 != 0 || i%400 == 0)
							k = k + 366;
						else 
							k = k + 365;
				}
		n = k/7 + 1;														//ќпредел€ем номер издани€
		printf("Ќомер последнего издани€ - %d", n);

	getch();
}

